In [3]:
# Creating dataframe
import pandas as pd
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [5]:
# Each column is a series in dataframe
print(type("Age"))
print(type(df["Age"]))

<class 'str'>
<class 'pandas.core.series.Series'>

In [6]:
df["Age"].max()

58

In [10]:
# Use of loc(label based)
adult_names=df.loc[df["Age"]>40,"Name"]
print(adult_names)

2    Bonnell, Miss. Elizabeth
Name: Name, dtype: object

In [13]:
# Use of iloc(Integer-position_based)
df.iloc[:,0:2]

                       Name  Age
0   Braund, Mr. Owen Harris   22
1  Allen, Mr. William Henry   35
2  Bonnell, Miss. Elizabeth   58

In [16]:
df.iloc[:,0]="Name"
df

   Name  Age     Sex
0  Name   22    male
1  Name   35    male
2  Name   58  female